tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf707_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF707_H_
#define _PIC16LF707_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define AN0                           13
#define RA0                           14
#define AN1                           15
#define RA1                           16
#define CPSA0                         17
#define AN2                           18
#define DACOUT                        19
#define RA2                           20
#define CPSA1                         21
#define AN3                           22
#define RA3                           23
#define CPSA2                         24
#define TACKI                         25
#define T0CKI                         26
#define RA4                           27
#define CPSA3                         28
#define AN4                           29
#define RA5                           30
#define CPSA4                         31
#define CLKOUT                        32
#define CPSB1                         33
#define RA6                           34
#define OSC2                          35
#define CLKIN                         36
#define CPSB0                         37
#define RA7                           38
#define OSC1                          39
#define PORTB                         40
#define CPSB8                         41
#define RB0                           42
#define AN12                          43
#define CPSB9                         44
#define RB1                           45
#define AN10                          46
#define AN8                           47
#define RB2                           48
#define CPSB10                        49
#define AN9                           50
#define RB3                           51
#define PORTB_CCP2                    52
#define CPSB11                        53
#define RB4                           54
#define AN11                          55
#define CPSB12                        56
#define T3CKI                         57
#define RB5                           58
#define T1G                           59
#define AN13                          60
#define CPSB13                        61
#define RB6                           62
#define CPSB14                        63
#define RB7                           64
#define CPSB15                        65
#define PORTC                         66
#define CPSB2                         67
#define T1CKI                         68
#define T1OSO                         69
#define RC0                           70
#define CPSB3                         71
#define PORTC_CCP2                    72
#define T1OSI                         73
#define RC1                           74
#define CCP1                          75
#define CPSB4                         76
#define TBCKI                         77
#define RC2                           78
#define SCL                           79
#define SCK                           80
#define RC3                           81
#define RC4                           82
#define SDA                           83
#define SDI                           84
#define CPSA9                         85
#define RC5                           86
#define SDO                           87
#define CPSA10                        88
#define TX                            89
#define CK                            90
#define RC6                           91
#define CPSA11                        92
#define DT                            93
#define RX                            94
#define RC7                           95
#define PORTD                         96
#define RD0                           97
#define CPSB5                         98
#define T3G                           99
#define RD1                           100
#define CPSB6                         101
#define RD2                           102
#define CPSB7                         103
#define RD3                           104
#define CPSA8                         105
#define RD4                           106
#define CPSA12                        107
#define RD5                           108
#define CPSA13                        109
#define RD6                           110
#define CPSA14                        111
#define RD7                           112
#define CPSA15                        113
#define PORTE                         114
#define CPSA5                         115
#define RE0                           116
#define AN5                           117
#define CPSA6                         118
#define RE1                           119
#define AN6                           120
#define RE2                           121
#define AN7                           122
#define CPSA7                         123
#define RE3                           124
#define nMCLR                         125
#define PCLATH                        126
#define INTCON                        127
#define RBIF                          128
#define INTF                          129
#define T0IF                          130
#define TMR0IF                        131
#define RBIE                          132
#define INTE                          133
#define T0IE                          134
#define TMR0IE                        135
#define PEIE                          136
#define GIE                           137
#define PIR1                          138
#define TMR1IF                        139
#define TMR2IF                        140
#define CCP1IF                        141
#define SSPIF                         142
#define TXIF                          143
#define RCIF                          144
#define ADIF                          145
#define TMR1GIF                       146
#define PIR2                          147
#define CCP2IF                        148
#define TMRAIF                        149
#define TMRBIF                        150
#define TMR3IF                        151
#define TMR3GIF                       152
#define T1CON                         153
#define TMR1ON                        154
#define T1SYNC                        155
#define nT1SYNC                       156
#define T1OSCEN                       157
#define T1CKPS0                       158
#define T1CKPS                        159
#define T1CKPS1                       160
#define TMR1CS                        161
#define TMRCS0                        162
#define TMRCS1                        163
#define T2CON                         164
#define T2CKPS0                       165
#define T2CKPS                        166
#define T2CKPS1                       167
#define TMR2ON                        168
#define TOUTPS0                       169
#define TOUTPS                        170
#define TOUTPS1                       171
#define TOUTPS2                       172
#define TOUTPS3                       173
#define SSPCON                        174
#define SSPM0                         175
#define SSPM                          176
#define SSPM1                         177
#define SSPM2                         178
#define SSPM3                         179
#define CKP                           180
#define SSPEN                         181
#define SSPOV                         182
#define WCOL                          183
#define CCP1CON                       184
#define CCP1M0                        185
#define CCP1M                         186
#define CCP1M1                        187
#define CCP1M2                        188
#define CCP1M3                        189
#define DC1B                          190
#define DC1B0                         191
#define DC1B1                         192
#define RCSTA                         193
#define RX9D                          194
#define OERR                          195
#define FERR                          196
#define ADDEN                         197
#define CREN                          198
#define SREN                          199
#define RX9                           200
#define SPEN                          201
#define CCP2CON                       202
#define CCP2M                         203
#define CCP2M0                        204
#define CCP2M1                        205
#define CCP2M2                        206
#define CCP2M3                        207
#define DC2B0                         208
#define DC2B                          209
#define DC2B1                         210
#define ADCON0                        211
#define ADON                          212
#define GO_nDONE                      213
#define CHS0                          214
#define CHS                           215
#define CHS1                          216
#define CHS2                          217
#define CHS3                          218
#define OPTION_REG                    219
#define PS                            220
#define PS0                           221
#define PS1                           222
#define PS2                           223
#define PSA                           224
#define T0SE                          225
#define TMR0SE                        226
#define T0CS                          227
#define TMR0CS                        228
#define INTEDG                        229
#define nRBPU                         230
#define TRISA                         231
#define TRISA0                        232
#define TRISA1                        233
#define TRISA2                        234
#define TRISA3                        235
#define TRISA4                        236
#define TRISA5                        237
#define TRISA6                        238
#define TRISA7                        239
#define TRISB                         240
#define TRISB0                        241
#define TRISB1                        242
#define TRISB2                        243
#define TRISB3                        244
#define TRISB4                        245
#define TRISB5                        246
#define TRISB6                        247
#define TRISB7                        248
#define TRISC                         249
#define TRISC0                        250
#define TRISC1                        251
#define TRISC2                        252
#define TRISC3                        253
#define TRISC4                        254
#define TRISC5                        255
#define TRISC6                        256
#define TRISC7                        257
#define TRISD                         258
#define TRISD0                        259
#define TRISD1                        260
#define TRISD2                        261
#define TRISD3                        262
#define TRISD4                        263
#define TRISD5                        264
#define TRISD6                        265
#define TRISD7                        266
#define TRISE                         267
#define TRISE0                        268
#define TRISE1                        269
#define TRISE2                        270
#define TRISE3                        271
#define PIE1                          272
#define TMR1IE                        273
#define TMR2IE                        274
#define CCP1IE                        275
#define SSPIE                         276
#define TXIE                          277
#define RCIE                          278
#define ADIE                          279
#define TMR1GIE                       280
#define PIE2                          281
#define CCP2IE                        282
#define TMRAIE                        283
#define TMRBIE                        284
#define TMR3IE                        285
#define TMR3GIE                       286
#define PCON                          287
#define nBOR                          288
#define nPOR                          289
#define T1GCON                        290
#define T1GSS0                        291
#define T1GSS                         292
#define T1GSS1                        293
#define T1GVAL                        294
#define T1GGO_nDONE                   295
#define T1GSPM                        296
#define T1GTM                         297
#define T1GPOL                        298
#define TMR1GE                        299
#define OSCCON                        300
#define ICSS                          301
#define ICSL                          302
#define IRCF                          303
#define IRCF0                         304
#define IRCF1                         305
#define OSCTUNE                       306
#define TUN                           307
#define SSPADD                        308
#define SSPMSK                        309
#define SSPSTAT                       310
#define BF                            311
#define UA                            312
#define R_nW                          313
#define S                             314
#define P                             315
#define D_nA                          316
#define CKE                           317
#define SMP                           318
#define WPUB                          319
#define WPUB0                         320
#define WPUB1                         321
#define WPUB2                         322
#define WPUB3                         323
#define WPUB4                         324
#define WPUB5                         325
#define WPUB6                         326
#define WPUB7                         327
#define IOCB                          328
#define IOCB0                         329
#define IOCB1                         330
#define IOCB2                         331
#define IOCB3                         332
#define IOCB4                         333
#define IOCB5                         334
#define IOCB6                         335
#define IOCB7                         336
#define T3CON                         337
#define TMR3ON                        338
#define T3SYNC                        339
#define T3CKPS                        340
#define T3CKPS0                       341
#define T3CKPS1                       342
#define TMR3CS0                       343
#define TMR3CS                        344
#define TMR3CS1                       345
#define TXSTA                         346
#define TX9D                          347
#define TRMT                          348
#define BRGH                          349
#define SYNC                          350
#define TXEN                          351
#define TX9                           352
#define CSRC                          353
#define APFCON                        354
#define CCP2SEL                       355
#define SSSEL                         356
#define FVRCON                        357
#define ADFVR0                        358
#define ADFVR                         359
#define ADFVR1                        360
#define CDAFVR0                       361
#define CDAFVR                        362
#define CDAFVR1                       363
#define FVREN                         364
#define FVRRDY                        365
#define T3GCON                        366
#define T3GSS0                        367
#define T3GSS                         368
#define T3GSS1                        369
#define T3GVAL                        370
#define T3GGO_nDONE                   371
#define T3GSPM                        372
#define T3GTM                         373
#define T3GPOL                        374
#define TMR3GE                        375
#define ADCON1                        376
#define ADREF                         377
#define ADREF0                        378
#define ADREF1                        379
#define ADCS0                         380
#define ADCS                          381
#define ADCS1                         382
#define ADCS2                         383
#define TACON                         384
#define TAPS                          385
#define TMRAPS0                       386
#define TAPS0                         387
#define TMRAPS                        388
#define TAPS1                         389
#define TMRAPS1                       390
#define TAPS2                         391
#define TMRAPS2                       392
#define TMRAPSA                       393
#define TAPSA                         394
#define TASE                          395
#define TMRASE                        396
#define TACS                          397
#define TMRACS                        398
#define TMRAON                        399
#define CPSBCON0                      400
#define TBXCS                         401
#define CPSBOUT                       402
#define CPSBRNG0                      403
#define CPSBRNG                       404
#define CPSBRNG1                      405
#define CPSBRM                        406
#define CPSBON                        407
#define CPSBCON1                      408
#define CPSBCH                        409
#define CPSBCH0                       410
#define CPSBCH1                       411
#define CPSBCH2                       412
#define CPSBCH3                       413
#define CPSACON0                      414
#define TAXCS                         415
#define CPSAOUT                       416
#define CPSARNG0                      417
#define CPSARNG                       418
#define CPSARNG1                      419
#define CPSARM                        420
#define CPSAON                        421
#define CPSACON1                      422
#define CPSACH                        423
#define CPSACH0                       424
#define CPSACH1                       425
#define CPSACH2                       426
#define CPSACH3                       427
#define TBCON                         428
#define TBPS                          429
#define TBPS0                         430
#define TMRBPS0                       431
#define TMRBPS                        432
#define TMRBPS1                       433
#define TBPS1                         434
#define TMRBPS2                       435
#define TBPS2                         436
#define TBPSA                         437
#define TMRBPSA                       438
#define TBSE                          439
#define TMRBSE                        440
#define TMRBCS                        441
#define TBCS                          442
#define TMRBON                        443
#define DACCON0                       444
#define DACPSS                        445
#define DACPSS0                       446
#define DACPSS1                       447
#define DACOE                         448
#define DACLPS                        449
#define DACEN                         450
#define DACCON1                       451
#define DACR0                         452
#define DACR                          453
#define DACR1                         454
#define DACR2                         455
#define DACR3                         456
#define DACR4                         457
#define ANSELA                        458
#define ANSA0                         459
#define ANSA                          460
#define ANSA1                         461
#define ANSA2                         462
#define ANSA3                         463
#define ANSA4                         464
#define ANSA5                         465
#define ANSA6                         466
#define ANSA7                         467
#define ANSELB                        468
#define ANSB0                         469
#define ANSB                          470
#define ANSB1                         471
#define ANSB2                         472
#define ANSB3                         473
#define ANSB4                         474
#define ANSB5                         475
#define ANSB6                         476
#define ANSB7                         477
#define ANSELC                        478
#define ANSC0                         479
#define ANSC                          480
#define ANSC1                         481
#define ANSC2                         482
#define ANSC5                         483
#define ANSC6                         484
#define ANSC7                         485
#define ANSELD                        486
#define ANSD                          487
#define ANSD0                         488
#define ANSD1                         489
#define ANSD2                         490
#define ANSD3                         491
#define ANSD4                         492
#define ANSD5                         493
#define ANSD6                         494
#define ANSD7                         495
#define ANSELE                        496
#define ANSE                          497
#define ANSE0                         498
#define ANSE1                         499
#define ANSE2                         500
#define PMCON1                        501
#define RD                            502

#endif // _PIC16LF707_H_
